read_verilog ihp_dummy.v
hierarchy -check -top top

proc; opt; write_verilog -noattr 02_opt.v

techmap
write_verilog -noattr 03_techmap.v

stubnets




dfflibmap -liberty @PDK_ROOT@/ihp-sg13g2/libs.ref/sg13g2_stdcell/lib/sg13g2_stdcell_typ_1p20V_25C.lib
write_verilog -noattr 04_dff.v

abc -liberty @PDK_ROOT@/ihp-sg13g2/libs.ref/sg13g2_stdcell/lib/sg13g2_stdcell_typ_1p20V_25C.lib
write_verilog -noattr 05_gates.v

clean
write_verilog -noattr 06_final.v

stat -liberty @PDK_ROOT@/ihp-sg13g2/libs.ref/sg13g2_stdcell/lib/sg13g2_stdcell_typ_1p20V_25C.lib