read_verilog @INPUT@

proc; opt; write_verilog -noattr @BASENAME@_02_opt.v

techmap
write_verilog -noattr @BASENAME@_03_techmap.v

tmrx
write_verilog -noattr @BASENAME@_04_tmrx.v


flatten
write_verilog -noattr @BASENAME@_07_flattened.v

clean
write_verilog -noattr @BASENAME@_08_final.v
write_json @BASENAME@_08_final.json
