# synth.ys.in
read_slang --top top @VERILOG_FILE@ \
        --compat-mode --keep-hierarchy \
        --allow-use-before-declare --ignore-unknown-modules
hierarchy -check -top top

proc; opt;

techmap

tmrx_mark

read_liberty -lib @PDK_ROOT@/ihp-sg13g2/libs.ref/sg13g2_stdcell/lib/sg13g2_stdcell_typ_1p20V_25C.lib

dfflibmap -liberty @PDK_ROOT@/ihp-sg13g2/libs.ref/sg13g2_stdcell/lib/sg13g2_stdcell_typ_1p20V_25C.lib
abc -liberty @PDK_ROOT@/ihp-sg13g2/libs.ref/sg13g2_stdcell/lib/sg13g2_stdcell_typ_1p20V_25C.lib

tmrx -c @TOML_FILE@
write_verilog -noattr @TEST_NAME@_07_tmrx.v
opt -noff
techmap
dfflibmap -liberty @PDK_ROOT@/ihp-sg13g2/libs.ref/sg13g2_stdcell/lib/sg13g2_stdcell_typ_1p20V_25C.lib
abc -liberty @PDK_ROOT@/ihp-sg13g2/libs.ref/sg13g2_stdcell/lib/sg13g2_stdcell_typ_1p20V_25C.lib -D 1000

opt_clean -purge

clean
write_verilog -noattr @TEST_NAME@_08_final.v
write_json @TEST_NAME@_08_final.json
show -format svg -prefix @TEST_NAME@_final_netlist top
show -format dot -prefix @TEST_NAME@_final_netlist top

stat -liberty @PDK_ROOT@/ihp-sg13g2/libs.ref/sg13g2_stdcell/lib/sg13g2_stdcell_typ_1p20V_25C.lib


design -reset

read_slang --top top @VERILOG_FILE@ \
        --compat-mode --keep-hierarchy \
        --allow-use-before-declare --ignore-unknown-modules

prep -top top
flatten
clean
design -stash gold



design -reset

read_liberty -ignore_miss_func @PDK_ROOT@/ihp-sg13g2/libs.ref/sg13g2_stdcell/lib/sg13g2_stdcell_typ_1p20V_25C.lib

read_verilog @TEST_NAME@_08_final.v
prep -top top
flatten
clean
design -stash gate



design -reset

design -copy-from gold -as gold_top top
design -copy-from gate -as synth_top top


async2sync gold_top
async2sync synth_top

equiv_make gold_top synth_top equiv
prep -top equiv


equiv_simple
# equiv_induct -undef
# equiv_status -assert

equiv_induct -seq 5 -undef
equiv_status
